# 전동킥보드 사고는 정말 많이 일어나고 위험할까?

## 1. 프로젝트 개요

#### [주제 설명]
- 최근 인터넷에서 '킥보드'라는 단어만 검색해도 뉴스, 인터넷 기사, 그리고 SNS에서 전동 킥보드와 관련된 사고 소식을 쉽게 접할 수 있습니다. 많은 사람들이 전동 킥보드의 등장 이후 사고가 급증했다고 말하며, 이를 도로의 무법자라고 부르기도 합니다. 전동 킥보드가 새로운 교통수단으로 자리잡으며 이용자가 급증한 가운데, 이에 대한 안전성에 대한 논란 또한 커지고 있습니다. 그러나 실제로 전동 킥보드로 인한 사고가 빈번히 발생하는 것일까요? 아니면 단순히 새로운 교통수단에 대한 사회적 관심과 미디어의 집중 보도로 인해 사고가 더 두드러져 보이는 것일까요? 이 프로젝트는 전동 킥보드 사고에 대한 실제 데이터를 분석하여 그 사고 빈도와 특성을 정확히 파악하고자 합니다.

#### [연구 질문]
- 본 프로젝트는 전동 킥보드 사고에 대한 다양한 데이터를 기반으로 아래의 핵심 질문에 대한 답을 찾고자 합니다
1) 전동 킥보드 사고는 다른 교통수단에 비해 얼마나 빈번하게 발생하는가?
2) 전동 킥보드 사고의 사망자수, 부상자수 등 심각도는 다른 교통수단에 비해 어떠한가?
3) 전동 킥보드 사고는 주로 어떠한 경우에 많이 발생하는가?
4) 전동 킥보드 사고를 줄이기 위해서는 어떻게 해야 하는가?
5) 만약에 전동 킥보드 사고가 많지 않다면 사람들은 왜 전동 킥보드 사고가 굉장히 빈번하고 자주 일어난다고 생각할까?

#### [프로젝트 목적]
- 이 프로젝트의 목적은 전동 킥보드 사고에 대한 객관적 데이터를 바탕으로 사고의 실제 빈도와 심각성을 분석하는 것입니다. 이를 통해 전동 킥보드 사고에 대한 대중의 인식과 미디어 보도 내용이 실제 사고 데이터와 어떻게 다른지 파악하고자 합니다. 또한 사고의 발생 빈도와 경향성을 차종, 연령, 계절 등을 기준으로 분석하여, 안전성 문제와 관련된 통찰을 도출하는 것을 목표로 합니다. 이 분석을 통해 정책 입안자나 사용자들이 전동 킥보드의 안전성에 대해 더 나은 결정을 내리는 데 기여하고자 합니다.


<br/></br>
<br/></br>


## 2. 개발환경 (Environment)
- 운영체제 : Window 11 Home
- 개발언어 : Python 3.12.4
- 개발도구 : Jupyter Notebook


<br/></br>
<br/></br>


## 3. 라이브러리 (Library)
- pandas == 2.2.2
- seaborn == 0.13.2
- matplotlib == 3.8.4


<br/></br>
<br/></br>


## 4. 파일 구조
- data
  - raw data/ : 최초 수집 데이터 
    - 차종별 월별 교통사고(2012).csv
    - 차종별 월별 교통사고(2013).csv
    - 차종별 월별 교통사고(2014).csv
    - 차종별 월별 교통사고(2015).csv
    - 차종별 월별 교통사고(2016).csv
    - 차종별 월별 교통사고(2017).csv
    - 차종별 월별 교통사고(2018).csv
    - 차종별 월별 교통사고(2019).csv
    - 차종별 월별 교통사고(2020).csv
    - 차종별 월별 교통사고(2021).csv
    - 차종별 월별 교통사고(2022).csv
    - 차종별 월별 교통사고(2023).csv
  
  - preprocessed data/ : 전처리 후 데이터
    - 연령대별 킥보드 사고건수.csv
    - 차종별 교통사고 유형 건수.csv

- Visualization : 데이터 시각화 이미지
- data_preprocessing.ipynb : 전처리 코드
- visualization_code.ipynb : 시각화 코드

<br/></br>
<br/></br>
  

## 5. 데이터셋 설명 (preprocessed data)
__1. 차종별 사고 유형과 건수 (2012년 ~ 2023년)__
- 데이터 출처 : 한국도로교통공단

| 컬럼명      | 설명                                          |
|-------------|-----------------------------------------------|
| 발생연도    | 사고가 발생한 연도                            |
| 발생월      | 사고가 발생한 월                              |
| 발생시간    | 사고가 발생한 시간대 (예: 00시, 01시, ..., 23시)|
| 가해자차종  | 사고를 일으킨 차량의 종류 (예: 승용차, 이륜차, 자전거, 전동킥보드 등) |
| 사고건수    | 해당 시간대에 발생한 총 사고 건수             |
| 사망자수    | 해당 시간대에 발생한 사고로 인한 사망자 수     |
| 부상자수    | 해당 시간대에 발생한 사고로 인한 부상자 수     |
| 중상자수    | 해당 시간대에 발생한 중상자의 수              |
| 경상자수    | 해당 시간대에 발생한 경상자의 수              |
| 부상신고자수| 해당 시간대에 발생한 부상 신고자의 수          |



__2. 연령대별 킥보드 사고 건수 데이터 (2017년 ~ 2022년)__
- 데이터 출처 : 공공데이터포털

| 컬럼명      | 설명                                          |
|-------------|-----------------------------------------------|
| 발생연도    | 사고가 발생한 연도                            |
| 나이        | 사고 가해자의 연령대 (예: 19세 이하, 20-29세) |
| 사고건수    | 해당 연령대에서 발생한 전동 킥보드 사고 건수  |
| 사망자수    | 해당 연령대에서 발생한 사고로 인한 사망자 수  |
| 부상자수    | 해당 연령대에서 발생한 사고로 인한 부상자 수  |


<br/></br>
<br/></br>


## 6. 데이터 전처리
#### [컬럼명 통일]
- 각 파일마다 Column명이 달라 통일시키기
<img width="747" alt="image" src="https://github.com/user-attachments/assets/2e06412a-7da9-42aa-b0e9-83b2045fe213">

<br/></br>

#### [각 데이터 구분을 위해 연도 컬럼 추가]
- 각 데이터는 연단위로 수집한 데이터이기에 연도 컬럼이 존재하지 않는다.
- 따라서 이를 그냥 병합할 경우 연도별 데이터를 구분할 수 없기 에 연도와 관련된 컬럼을 추가한다.

<br/></br>

#### [컬럼값 통일하기]
- 동일한 내용을 표현하지만 Column명이 다른 것들을 통일하기
```python
# 불명, 기타, 기타/불명 모두 기타로 통일하기
accident['가해자차종'] = accident['가해자차종'].replace({'불명':'기타', '기타/불명':'기타'})

# 개인형이동장치(PM)을 개인형이동수단(PM)로 통일하기
accident['가해자차종'] = accident['가해자차종'].replace({'개인형이동장치(PM)':'개인형이동수단(PM)'})

# 인덱스 재설정하기
accident = accident.reset_index(drop=True)
```

<br/></br>

#### [연/월 컬럼 생성]
- 연/월을 기준으로 사고건수를 파악하고자 해당 컬럼을 생성
```python
# 연 + 월로 연월 컬럼 생성하기
accident['연월'] = pd.to_datetime(accident['연도'].astype(str) + '-' + accident['발생월'].astype(str), format='%Y-%m')
```

<br/></br>

#### [계절 변수 추가하기]
- 계절에 따른 사고건수를 파악하고자 계절 변수를 생성
```python
# 계절을 판별하는 함수 정의
def get_season(month):
    if month in [3, 4, 5]:
        return '봄'
    elif month in [6, 7, 8]:
        return '여름'
    elif month in [9, 10, 11]:
        return '가을'
    else:
        return '겨울'

# '월' 열을 기반으로 계절 변수 추가
accident['계절'] = accident['발생월'].apply(get_season)
```


<br/></br>
<br/></br>


## 7. 데이터 분석 방법론
#### [연구질문 1,2,3에 대한 분석 방법론]
- 시간 데이터, 범주형 데이터, 수치형 데이터로 나올 수 있는 모든 경우의 수를 시각화하여 파악
- 시간별 연령대별 킥보드 사고 유형 데이터를 시각화하여 현황 파악
<img width="831" alt="image" src="https://github.com/user-attachments/assets/01e393ed-e845-46c2-945f-4cb7483082f7">

<br/></br>
<br/></br>


## 8. 차종별 사고 유형 데이터 시각화 & 시간별 연령대별 킥보드 사고 유형 시각화
- visualization 파일 참고


<br/></br>
<br/></br>


## 9. 결과 
### [연구질문1 결과 : 전동 킥보드 사고는 다른 교통수단에 비해 얼마나 빈번하게 발생하는가?] 
- __[Graph 1-1 참고]__ 전동 킥보드 사고는 다른 교통수단에 비해 전체 건수는 아직까지 적은 편에 속한다.
- __[Graph 6-1 참고]__ 그러나 사고 발생 건수의 증가 추세는 다른 교통수단에 비해 상당히 빠르게 나타나고 있다. 특히 2020년 이후 전동 킥보드 이용자가 급격히 늘어나면서 사고 건수도 가파르게 증가하고 있는 것으로 확인된다.
- 이러한 증가 추세는 전동 킥보드가 새로운 교통수단으로 자리 잡으면서 이용자 수가 급격하게 늘어난 결과로 추정된다. 다만, 현재의 증가 추세가 이용자 수의 증가 때문인지, 혹은 다른 안전 문제로 인한 것인지를 더 정확히 파악할 필요가 있다.
- 또한, 향후 이용자 수가 포화 상태에 도달한 이후에도 이러한 증가 추세가 지속될 것인지, 아니면 안정화될 것인지는 추후의 데이터를 통해 확인이 필요하다.

<br/></br>

### [연구질문2 결과 : 전동 킥보드 사고의 사망자수, 부상자수 등 심각도는 다른 교통수단에 비해 어떠한가?]
- __[Graph 6-1,2,3,4 참고]__ 전동 킥보드의 사망자 수, 중상자 수, 경상자 수, 부상신고자 수는 전체적인 건수 자체로만 보면 다른 교통수단에 비해 매우 적은 편에 속한다. 그러나 최근 몇년간 전동 킥보드의 이용자 수 증가에 따른 사고 발생 추세는 다른 교통수단에 비해 훨씬 가파르게 상승하고 있다.
- __[Graph 1-2 참고]__ 특히 사망자와 중상자 비율은 다른 차종에 비해 상대적으로 낮은 편이지만, 경상자와 부상신고자의 비율은 다른 교통수단에 비해 상당히 높은 것으로 나타난다. 이는 전동 킥보드로 인한 사고의 대부분이 심각하지 않은 경미한 사고에 그치는 경우가 많다는 것을 시사한다. 이처럼 사망과 중상 사고의 비율은 낮은 반면, 경상과 경미한 부상 신고는 잦다는 점은 전동 킥보드의 특성과 안전장치 부족, 이용자들의 안전 의식 부족 등이 영향을 미친 것으로 추정된다.
- 하지만 이러한 경미한 사고들이 대수롭지 않게 여겨지다 보면, 안전에 대한 경각심이 떨어져 더 큰 사고로 이어질 수 있다는 점에서 주의가 필요하다. 또한 전동 킥보드의 사고 증가 추세는 향후 이용자 수가 어느 정도 안정화된 이후에도 지속될지, 아니면 이용자 수와 함께 사고 건수도 안정될지에 대한 추가적인 데이터 분석이 필요할 것으로 보인다. 

<br/></br>

### [연구질문3 결과 : 전동 킥보드 사고는 주로 어떠한 경우에 많이 발생하는가?]
- __[Graph 7-1 참고]__ 전동 킥보드 사고는 주로 봄과 여름에 많이 발생하는 경향을 보인다. 이는 야외 활동이 활발해지는 계절적 특성과 관련이 있을 것으로 판단된다. 또한, 월별로 보면 5월부터 10월 사이에 사고 건수가 높게 나타나는데, 특히 7월과 8월은 이용자 수 증가와 함께 사고 빈도가 높아지는 것으로 추정된다.
- __[Graph 1-2 참고]__ 사고의 특성을 살펴보면, 경상자와 부상신고자의 비율이 높아 대부분이 큰 부상으로 이어지지 않는 경미한 사고가 많다는 것을 알 수 있다. 이는 전동 킥보드가 비교적 낮은 속도로 운행되고, 보호장비 미착용으로 인해 가벼운 부상이 발생하는 경우가 많은 것과 연관이 있을 수 있다.
- __[Graph 9-1 참고]__ 전동킥보드의 경우 주로 10대와 20대에 가장 많은 사고가 발생하고 있다. 사고건수에 있어서 10대에 가장 많이 발생한다. 하지만 10대의 경우 전동킥보드 탑승이 법적으로 금지되어 있는 상황이다
- __[Graph 9-2 참고]__ 사망자수의 경우 연령대가 높을수록 더 높은 비율로 발생한다는 것을 알 수 있다. 이는 연령대가 높을수록 사고 발생시 더 치명적인 부상을 당할 확률이 높다는 것을 알 수 있다.

<br/></br>

### [연구질문4 결과 : 전동 킥보드 사고를 줄이기 위해서는 어떻게 해야 하는가?]
#### [사고 건수를 줄이기 위한 대책]
- __[Graph 9-1 참고]__ 전동 킥보드 사고를 줄이기 위해서는 주요 사고 연령대인 10대의 사고를 감소시키는 것이 중요하다. 10대의 경우 전동 킥보드 운행이 법적으로 금지되어 있음에도 불구하고, 사고 건수가 상당히 높게 나타난다. 이는 불법 운행이 빈번히 발생하고 있음을 시사한다. 따라서 10대의 전동 킥보드 불법 운행을 단속하는 것보다, 강력한 본인인증 시스템을 도입하여 법적 연령 미달자가 전동 킥보드를 이용하지 못하도록 하는 것이 더 효과적일 것이다. 또한, 미성년자에게 계정을 빌려준 경우 처벌을 강화하는 방식으로 제도를 보완하여 불법 운행을 근본적으로 억제하는 조치가 필요하다
- __[Graph 7-1,2,3,4 참고]__ 전동 킥보드 사고는 대부분 5월에서 10월 사이의 여름과 가을에 집중되며, 겨울철에는 사고 발생이 크게 감소한다. 이는 개방형 교통수단인 전동 킥보드의 특성상 사고 건수가 날씨의 좋은 정도와 비례한다는 것을 보여준다. 따라서 날씨가 좋은 계절에 전동 킥보드 이용이 증가하면서 사고 발생도 함께 늘어나는 경향이 있다. 이러한 계절적 특성을 고려하여, 여름과 가을철에 사고를 줄이기 위한 실질적인 대책이 필요하다. 예를 들어, 기상 조건에 맞춘 안전 기능 강화나 날씨에 따라 전동 킥보드의 주행 성능을 자동으로 조정하는 기술 도입이 효과적일 수 있다. 또한, 이용자에게 기상 상황에 따른 주행 안전성 경고 메시지를 제공하여 사고를 예방할 수 있다.

<br/></br>

#### [치명적인 사고를 줄이기 위한 대책]
- __[Graph 7-2 참고]__ 사고 유형들이 전반적으로 유사한 추세를 따르지만, 특이하게도 사망자 건수에 있어 2월에 급격하게 증가하는 경향을 보인다. 이는 전반적인 사고 건수는 적지만 이 시기의 사고가 더 치명적인 사고로 이어질 가능성이 있음을 나타낸다. 2월은 겨울철로 도로 상태가 악화될 수 있으며, 빙판길, 눈 등으로 인해 전동 킥보드 운행 중 미끄러짐이나 충돌 같은 치명적인 사고가 발생할 수 있다. 따라서 2월과 같은 겨울철에는 도로의 상태가 불안정해지므로, 전동 킥보드 사용자들이 도로 상태에 대한 경각심을 가질 수 있도록 앱 내에 안내 문자를 제공해야 한다, 또한 겨울철에는 타이어에 미끄럼 방지 장치를 의무화하는 등의 조치를 취해야 한다.

<br/></br>

### [연구질문5 결과 : 만약에 전동 킥보드 사고가 많지 않다면 사람들은 왜 전동 킥보드 사고가 굉장히 빈번하고 자주 일어난다고 생각할까?]
#### [실제 전동 킥보드 사고현황]
- __[Graph 9-1,2,3, 10-1,2,3 참고]__ 전동킥보드 사고가 급증한 2022, 2023년에도 사고 건수 자체는 다른 차종에 비해 많지 않다. 2022년에는 12개의 차종 중 7번째로 높은 사고 건수가 발생했고, 2023년도에도 마찬가지이다. 이는 전체 교통사고 건수에서 약 1.2%의 사고를 차지한다. 그러나 사람들은 전동 킥보드 사고가 매우 빈번하다고 느끼는 경향이 있다.

<br/></br>

#### __[사람들이 전동 킥보드 사고가 빈번하고 자주 일어난다고 생각하는 이유]__
- 전동 킥보드 사고가 많지 않음에도 불구하고 사람들이 빈번하다고 생각하는 이유는 여러 가지로 분석될 수 있다.
1) __미디어의 주목도__: 언론 보도와 SNS에서 전동 킥보드 사고가 빈번하게 다뤄지며, 새로운 교통수단이라는 이유로 사고 소식이 과도하게 부각되는 경향이 있다. 또한, 많은 기자들은 다른 교통수단과의 사고 통계를 충분히 고려하지 않고, 전동 킥보드 이용자 수의 증가를 반영하지 않은 채 사고 건수만을 강조해 보도함으로써 실제 통계가 왜곡되어 전달되기도 한다.
2) __가시성 높은 사고__: 전동 킥보드 사고는 특히 보행자나 도로에서 자주 목격되며, 이러한 사건들이 사람들에게 크게 인식된다. 이는 사고의 발생 자체보다는 사람들이 느끼는 위험성이 크게 작용했을 가능성이 있다.
3) __새로운 교통수단에 대한 경각심__: 전동 킥보드는 비교적 최근에 등장한 교통수단이며, 익숙하지 않거나 안전 기준이 정착되지 않은 상태에서 사람들이 위험을 더 크게 느끼기 때문에 사고가 많다고 인식될 수 있다.
이와 같은 이유로 전동 킥보드 사고는 실제 발생 건수에 비해 사람들이 느끼는 빈도는 훨씬 높아질 수 있다.

<br/></br>
<br/></br>


## 10. 논의 및 결론
이번 프로젝트에서는 전동 킥보드 사고에 대한 객관적인 데이터를 바탕으로 사고의 발생 빈도와 심각성을 분석하여 여러 연구 질문에 대한 답을 도출했습니다. 이를 통해 전동 킥보드 사고에 대한 사회적 인식과 실제 데이터를 비교할 수 있었고, 전동 킥보드 사고를 줄이기 위한 방안에 대해서도 논의했습니다.

#### __[연구질문1 결과 요약]__
전동 킥보드는 사고 건수 자체로는 아직 다른 교통수단에 비해 상대적으로 적지만, 그 증가 속도는 매우 빠르게 나타나고 있습니다. 2020년 이후 급증하는 전동 킥보드의 이용자 수와 함께 사고 건수도 가파르게 상승했으며, 이는 새로운 교통수단으로서의 특성이 반영된 결과로 해석됩니다. 이와 같은 증가 추세는 이용자 수 증가와 관련이 있을 가능성이 크지만, 향후 이용자 수가 안정화된 이후에도 사고 건수가 지속적으로 증가할지 여부는 추가적인 데이터가 필요합니다.

#### __[연구질문2 결과 요약]__
전동 킥보드는 사고의 심각도 면에서 다른 교통수단과 차이를 보였습니다. 사망자와 중상자 수는 상대적으로 적지만, 경상자와 부상 신고자의 비율이 높아 주로 경미한 부상이 많이 발생하고 있습니다. 이는 전동 킥보드의 운행 특성상 심각한 사고보다는 경미한 사고가 많다는 점을 시사합니다. 하지만 이러한 경미한 사고도 무시할 수 없으며, 안전에 대한 경각심을 잃지 않는 것이 중요합니다.

#### __[연구질문3 결과 요약]__
전동 킥보드 사고는 계절적 변동이 뚜렷하게 나타났습니다. 사고는 주로 여름과 가을철에 집중되며, 특히 5월부터 10월 사이에 많이 발생하고 있습니다. 이는 야외 활동이 활발해지는 계절적 특성과 밀접한 관련이 있으며, 이용자 증가와 사고 발생이 비례하는 경향을 보입니다. 또한, 10대와 20대에서 사고가 많이 발생하며, 특히 10대의 경우 전동 킥보드 불법 운행이 빈번히 발생하고 있다는 점이 확인되었습니다.

#### __[연구질문4 결과 요약]__
전동 킥보드 사고를 줄이기 위해서는 계절적 특성과 연령별 사고 특성을 반영한 실질적인 대책이 필요합니다. 특히 10대의 불법 운행을 줄이기 위해 강력한 본인 인증 시스템 도입과 처벌 강화가 필요합니다. 10대에 일어나는 사고만 줄여도 전체 전동 킥보드 사고의 30% 가량의 사고를 줄일 수 있습니다. 또한, 여름과 가을철의 사고를 줄이기 위해 기상 조건에 맞춘 주행 안전 기능 강화와 겨울철인 2월에 급증하는 사망 사고를 줄이기 위해 타이어 미끄럼 방지 장치 의무화와 같은 기술적인 보완도 필요합니다.

#### __[연구질문5 결과 요약]__
전동 킥보드 사고가 실제로 많지 않음에도 불구하고, 사람들은 미디어 보도와 가시성 높은 사고 사례로 인해 사고가 빈번하게 발생한다고 인식하는 경향이 있습니다. 이는 새로운 교통수단에 대한 경각심과 언론의 주목도가 크게 작용한 결과로 분석됩니다. 따라서 미디어에서의 보도 방식도 사고의 실제 통계와 균형 있게 다뤄질 필요가 있습니다.

#### __[결론]__
전동 킥보드는 사고 건수 면에서는 여전히 다른 교통수단에 비해 적은 편이지만, 그 증가 추세와 사고 발생 빈도는 주목할 필요가 있습니다. 이용자 수가 계속해서 증가하는 상황에서, 사고를 줄이기 위한 보다 실질적인 정책과 기술적 보완이 필요합니다. 특히, 전동 킥보드와 같은 새로운 교통수단에 대한 올바른 인식과 안전 교육이 필요하며, 미디어 보도 또한 균형 잡힌 시각을 제공할 필요가 있습니다.

<br/></br>
<br/></br>
